[{
	"Id": "001",
	"Description": "You awake alone and groggy in a cold damp cell. You can't remember how you got here. Light pours in through a hole in the ceiling, its far to high to reach. For a moment a silohette of a man blocks the light, he drops something and disappears. The object makes a metallic clink as it hits the stone cell floor. Scurrying over you take the item, it is a key",
	"Options":
		[
			{
				"Text": "Shout for help", 
				"Goto": "002"
			},
			{
				"Text": "Use the key to leave the cell",
				"Goto": "003"
			}
		]
},
{
	"Id": "002",
	"OnEnter": "funcs.IncreaseStat(player, 'Skill', 2)",
	"Description": "It's no use the figure has gone and doesn't look like he's coming back. You're on your own",
	"Options":
		[			
			{
				"Text": "Use the key to leave the cell",
				"Goto": "003"
			}
		]
},
{
	"Id": "003",
	"Description": 
		"To your great surprise the key fits the lock and the cell door opens. You emerge into a dank dimly lit corridor. You come across the decicated corpse of a soldier, a sword still sticks out from him",
	"Options":
		[			
			{
				"Text": "Leave the sword",
				"Goto": "004"
			},
			{
				"Text": "Take the sword",
				"Goto": "005"
			}
		]
},
{
	"Id": "004",
	"Description": "The thought of disturbing the corpse unsettles you so you leave it alone and move on",
	"Options":
		[
			{
				"Text": "Advance",
				"Goto": "006"
			}
		]
},
{
	"Id": "005",
	"OnEnter": "funcs.AddItem(player, 'Sword')",
	"Description": "You wrestle the sword free with some effort, to your horror as you do so the corpse begins to moan and move. You look on horrified as it stands and turns to face you",
	"Options":
		[
			{
				"Text": "Fight for your life",
				"Enemy":
				{
					"Name": "Hollow Soldier",
					"Skill": 8,
					"HP": 3
				},
				"GotoOnWin": "006"
			},
			{
				"Text": "Run for it",
				"Goto": "005b"
			}
		]
},
{
	"Id": "005b",
	"Description": "The creature swipes at you as you turn, its claws rake across your arm leaving a stinging wound",
	"OnLeave": "funcs.Hurt(player, 2)",
	"Goto": "006"
},
{
	"Id": "006",
	"Description": "Leaving the dank corridor you find a ladder that leads you to the open air. You find yourself in the ruins of an old castle perched precariously on the side of a great raive. You have arrived at fire link shrine"
}
]